{
  "id": "88eaf3d8748767418665db2f5c297bfaa70a78e31b0714d47ad34ee5f8cd4efb",
  "title": ": Accounting Supervisor - General",
  "department": "Finance and Accounting",
  "purpose": "To provide general supervision of the General Books Unit of the Accounting Department so as to\nensure timely and accurate recording of all financial transactions, proper management of accounts\nreceivable and to facilitate the generation of management report.",
  "relationships": "Reports to the Chief Accountant.",
  "supervisory": "Directly supervises employees in the Accounts Department. Carries out supervisory\nresponsibilities in accordance with the organization's policies and applicable laws.",
  "knowledge": "To perform this job successfully, an individual must be able to perform each essential duty\nsatisfactorily. The requirements listed below are representative of the knowledge, skills and/or\nabilities required.",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "1. Provides supervision and guidance to all accounting personnel under responsibility.",
    "Transaction Processing",
    "2. Monitor the progress of transaction posting to the General Ledger to ensure completeness and",
    "closure within five working days to the month end.",
    "3. Checks Journal Vouchers. Receipts and payment of invoices for proper authority, cost",
    "allocation and dollar value.",
    "4. Ensure that the daily cash summary agrees with the receipt pack and lodgment slip(s).",
    "Accounts Receivables",
    "5. Checks all Debit Note and Credit memos for accuracy and completeness.",
    "Accounts Payable",
    "6. Ensure that all invoices (local and foreign) are processed accurately, properly authorized and",
    "paid promptly.",
    "7. Determine the priority for payment for due invoices.",
    "8. Ensure that cheques are delivered to front desk (where applicable) promptly or sent to",
    "creditors.",
    "9. Maintain the Master data for General Ledger, Accounts Receivable and Accounts payable.",
    "10. Books Refinery Oil purchases and freight charge.",
    "11. Checks Accounts Payable monthly analyses of all payable accounts and follow up on",
    "outstanding items.",
    "12. Review monthly accruals (utilities, custom payment, insurance etc.) for accuracy and",
    "completeness.",
    "General",
    "13. Informs the Chief Accountant promptly of any problems that need attention",
    "14. Checks J$ equivalent to all US$ maintained bank account and do necessary Journal",
    "adjustments monthly (i.e. calculate and book FX Gain/Loss each month).",
    "15. Monitors the bearer's schedule with respect to the dispatch and collection of cheques and",
    "invoices.",
    "16. Ensure that all balance sheet schedules are prepared and reviewed on a quarterly basis.",
    "17. Review monthly payment schedule for traveling.",
    "18. Generally complies with all rules regulations or guidelines of various policies issued by the",
    "company from time to time such as General Administration, Safety, Health and Loss Control.",
    "19. Keeps abreast of all aspects of the business of the Company, the organization structure,",
    "policies, systems and be fully knowledge in the financial control systems of the Company.",
    "20. Liaises with Marketing, Administration, Logistics and other department as necessary.",
    "21. Prepare Price list for Petroleum Products in the absence of the Chief Accountant.",
    "22. Books Refinery monthly cargo purchases and freight and insurance charge (creating the",
    "Purchase order and Goods Receipt) via SAP.",
    "23. Prepare Invoice Verification Postings and post payments on Trade Invoices/loans and",
    "Freight Invoices (excluding PDVSA cargoes) via SAP",
    "24. Compute & post the foreign exchange gain or loss on Foreign vendor balances",
    "25. Prepares Monthly Cargo Purchases Summary",
    "26. Prepare and analyse the GI-IR (account #211200) monthly",
    "27. Ensures the accuracy and cross check the Petrojam's Investments Schedules against the",
    "general ledger.",
    "28. Checks Petrojam's monthly Oil Liability Report",
    "29. Checks the Employees' Savings Funds Investment Register",
    "30. Follow up on advance payments made from petty cash imprest",
    "31. Follow- up on US$ request for foreign travel",
    "32. Conduct spot checks on Petty Cash imprest",
    "33. Support Financial Statement Audits",
    "Insurance",
    "34. Review monthly entry to record insurance accruals",
    "Inter-Company",
    "35. Post inter — company transaction.",
    "36. Prepare inter-company reconciliation.",
    "37. Liaise with Group Officers on financial activities involving Petrojam, PCJ, JARS, PEL and",
    "PDVSA."
  ],
  "education": [
    " Accounting Degree from a recognized tertiary institution or equivalent Intermediate",
    "Professional Accounting qualifications",
    " Four to five (4-5) years relevant experience"
  ],
  "performance": [
    "The job is satisfactorily performed when:",
    "1. A minimum accuracy level of 99.5% is maintained.",
    "2. Outstanding payment should be made within the credit period or within seven days after",
    "receipt of invoices.",
    "3. Accounts Receivable are followed up to ensure achievement of Key Performance Indicator",
    "i.e. 95% collection on due dates. (Bring disputed receivables to management's attention",
    "promptly so that decisive measures can be employed to ensure full collection).",
    "4. The preparation of all monthly reconciliation of Balance Sheet accounts such as",
    "Prepayments must be completed within fifteen days of month end closing.",
    "5. Correcting journal entries should be kept to a minimum and should be prepared and posted",
    "to the General Ledger by the following month end.",
    "6. The incumbent provides service of the highest standard to Petrojam's internal and external",
    "customers and gives full cooperation to internal and external auditors. Provide information",
    "request by auditors on a timely basis, thereby ensuring timely completion of audit.",
    "7. There is compliance with established company policies, rules and International Accounting",
    "Standards.",
    "8. Punctuality in attendance at work and meetings is observed.",
    "9. There is allocation of adequate amount of time for employee development including",
    "compliance with Appraisal Program Guideline.",
    "10. Compliance with established company policies and rules",
    "11. There is effective administration of grievance procedure and disciplinary schedule and",
    "application of company policy."
  ],
  "publicJSONPath": "/JSON-job-descriptions/finance_and_accounting/accounting_supervisor___general_books.json",
  "publicPDFPath": "/uploaded-job-descriptions/accounting_supervisor___general_books.pdf"
}