{
  "id": "b4f95e459bfba150c329758c4ac0ef6fea9c34ab17156e33f8c21b8c50331089",
  "title": "Accounting Officer - Banking and Investment",
  "department": "Finance and Accounting",
  "purpose": "To assess, monitor, plan and manage the efficient utilization of cash and financial services in a\nmanner consistent with the objectives of the Company.",
  "relationships": "Reports to Financial Treasurer & Budget Planner.",
  "supervisory": "This position has no supervisory responsibilities.",
  "knowledge": "To perform this job successfully, an individual must be able to perform each essential duty\nsatisfactorily. The requirements listed below are representative of the knowledge, skills and/or\nabilities required.",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "Treasury & Cash Management",
    "1. Prepare weekly forecast for cash and foreign exchange (through the Bank of Jamaica)",
    "requirements.",
    "2. Execute daily financing decisions that encompass scheduling oil liabilities for payments, the",
    "funding of bank accounts and intra bank transfers.",
    "3. Reviews the daily cash report and attest bank lodgment.",
    "4. Manage all aspects of In-house investment portfolios. Maintains register of short term",
    "deposits and repurchase agreements that includes the scheduling of rollover and encashment;",
    "and maintaining security documents and tax certificates.",
    "5. Prepare the general ledger reconciliation for principal balances, interest earned and interest",
    "receivable.",
    "6. Provide support to the Treasury Officer in developing strategies for cash & liquidity",
    "programming",
    "Trade Finance",
    "7. Develop the trade financing schedule for the importation of crude oil and finished products",
    "by to monthly import / feedstock slate from the Logistics & Marketing Department.",
    "8. Arrange the financing terms and documents for the execution of trade: rates, test code,",
    "promissory note, language for letter of credit (LC) and confirmation transmittals.",
    "9. Prepare general ledger entries and reconciliations for interest accrued, principal balances and",
    "foreign exchange revaluation.",
    "10. Prepare the oil liability payment schedule and monitor payments.",
    "11. Prepare the Statement C report for the Ministry of Finance",
    "12. Support the Treasury Officer in developing the quarterly variance analysis for the Statement",
    "A forecast on bank and supplier financing.",
    "13. Manage relationships with financial service providers.",
    "Other",
    "14. Provide support in audits: internal and external",
    "15. Prepare Education Assistance Bank reconciliation.",
    "16. Undertakes such other duties as may be assigned from time to time."
  ],
  "education": [
    " B.Sc. in Accounting or equivalent tertiary qualification."
  ],
  "performance": [
    "The job is satisfactorily performed when:",
    "1. Transactions are validated and meets accounting standard.",
    "2. All transactions booked within four days of month end to facilitate timely closing.",
    "3. Interest income schedule prepared within five working days of the receipt of the General",
    "Ledger.",
    "4. Compliance with established company policies and rules",
    "5. Punctuality in attendance at work and at meetings.",
    "6. Provides service readily when required to do so."
  ],
  "publicJSONPath": "/JSON-job-descriptions/finance_and_accounting/accounting_officer___banking___investment.json",
  "publicPDFPath": "/uploaded-job-descriptions/accounting_officer___banking___investment.pdf"
}