{
  "id": "2e62be6454060621717f7a62183b3748f9d5f23c6f2dc05128b080b7a005b72e",
  "title": "Accounting Clerk – Local Payables",
  "department": "Finance & Accounting",
  "purpose": "Computes, classifies, records, and verifies numerical data for use in maintaining accounting\nrecords.",
  "relationships": "Reports to the Accounting Supervisor – General Books",
  "supervisory": "This job has no supervisory responsibilities.",
  "knowledge": "To perform this job successfully, an individual must be able to perform each essential duty\nsatisfactorily. The requirements listed below are representative of the knowledge, skills, and/or\nabilities required.",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "1. Codes all invoices and presents them to supervisor for proper approval.",
    "2. Inputs coded invoices to computer.",
    "3. Prints Bank Report and cheques.",
    "4. Protectographs all cheques issued and presents for signature.",
    "5. Responds to all written and telephone inquiries regarding accounts payable promptly.",
    "6. Prepares Accruals (unpaid bills) for month end closing.",
    "7. Prepares journal in respect of Property Tax from quarterly payments.",
    "8. Files invoices by Customer Number.",
    "9. Generally complies with all rules and regulations or guidelines of various policies issued by",
    "the company from time to time such as General Administration, Safety, Health and Loss",
    "Control."
  ],
  "education": [
    " High School education with passes at the GCE ‘A' Level in Accounts and minimum of three",
    "other CXC subjects, including Mathematics.",
    " Certificate / Diploma in Accounts",
    " One to three years related experience and/or training; or equivalent combination of education",
    "and experience."
  ],
  "performance": [],
  "publicJSONPath": "/JSON-job-descriptions/finance___accounting/accounting_clerk___local_payables_.json",
  "publicPDFPath": "/uploaded-job-descriptions/finance___accounting/accounting_clerk___local_payables_.pdf"
}