{
  "id": "347dda4447d7b5dca1aa23c4149522509203bff5ea3321a887dc65962aca5b0c",
  "title": "Accounts Clerk II – Stocks & Sales (Computer Billing)",
  "department": "Finance & Accounting",
  "purpose": "Computes, classifies, records, and verifies numerical data for use in maintaining accounting records.",
  "relationships": "Reports to Accounting Supervisor – Stocks & Sales",
  "supervisory": "This job has no supervisory responsibilities.",
  "knowledge": "To perform this job successfully, an individual must be able to perform each essential duty\nsatisfactorily. The requirements listed below are representative of the knowledge, skills, and/or\nabilities required.",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "1. Calculates month end inventory for Petrojam Ethanol and makes necessary Journal entries.",
    "2. Prepares various statistical information and reports to government agencies like Department",
    "of Statistics, Bank of Jamaica, Ministry of Mining & Energy and non-governmental agencies",
    "like the United States Embassy.",
    "3. Prepares monthly reconciliation of 153 & 151 Accounts along with adjusting entries.",
    "4. Reconciles 222 Account and prepares adjusting entries on a monthly basis.",
    "5. Reconciles, prepares and adjusts entries of 215025 and 212099 Accounts on a monthly basis.",
    "6. Prepares and books Debit Note for line handling and other charges.",
    "7. Prepares and books Credit Note to Petroleum Corporation of Jamaica for commission (1%)",
    "on crude and products on a monthly basis.",
    "8. Books Demurrage charges incurred on imports on a monthly basis.",
    "9. Prepares and makes necessary entries for Bank Reconciliation – BNS Account for Ethanol.",
    "10. Posts monthly entries to reflect month end rate of exchange on the account at BNS (New",
    "York), with General Ledger.",
    "11. Computes monthly General Consumption Tax and prepares the returns.",
    "12. Performs all other duties that may be assigned.",
    "13. Generally complies with all rules and regulations or guidelines of various policies issued by",
    "the company from time to time such as General Administration, Safety, Health and Loss",
    "Control."
  ],
  "education": [
    " High School education with passes at the GCE ‘A' Level in Accounts and minimum of three",
    "other CXC subjects, including Mathematics",
    " Certificate / Diploma in Accounts",
    " One to three years related experience and/or training; or equivalent combination of education and",
    "experience."
  ],
  "performance": [],
  "publicJSONPath": "/JSON-job-descriptions/finance___accounting/accounts_clerk___computer_billing.json",
  "publicPDFPath": "/uploaded-job-descriptions/accounts_clerk___computer_billing.pdf"
}