{
  "id": "394fed9520305b1c1956edb19173d957aa7260a085ee3f45d83fd35784056069",
  "title": "Accounts Receivables Clerk – General Books",
  "department": "Finance & Accounting",
  "purpose": "Records payments to customers’ accounts and maintains accounts receivable records.",
  "relationships": "Reports to the Accounts Supervisor – General Books",
  "supervisory": "This job has no supervisory responsibilities.",
  "knowledge": "To perform this job successfully, an individual must be able to perform each essential duty\nsatisfactorily. The requirements listed below are representative of the knowledge, skills, and/or\nabilities required.",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "1. Maintains all posting for receivables by recording the transactions on a daily basis and",
    "maintains customer files.",
    "2. Receives weekly sales summary sheet from “Stocks and Sales” section and monitors them",
    "for collection.",
    "3. Compares collections with Billings and advises Financial Controller on a weekly basis, of",
    "any short payments.",
    "4. Prepares a statement of outstanding receivables weekly.",
    "5. Prints “ageing analysis” of receivables at the end of each month.",
    "6. Maintain employees’ receivables.",
    "7. Prepares debit notes for testing of samples, sludge removal and ship water charges.",
    "8. Prepare monthly prepaid insurance.",
    "9. Follows up on Collections from the Marketing Company, etc. and assist the Chief",
    "Accountant.",
    "10. Prepares arrears notice to delinquent customers.",
    "11. Separates, analyzes and books monthly gasoline reports by company, department and by",
    "products (reports from gas pump).",
    "12. Performs any other duties that may be assigned.",
    "13. Generally complies with all rules and regulations or guidelines of various policies issued by",
    "the company from time to time such as General Administration, Safety, Health and Loss",
    "Control."
  ],
  "education": [
    " High School education with passes at the GCE ‘A’ Level in Accounts and minimum of three",
    "other CXC subjects including Mathematics",
    " Certificate / Diploma in Accounts",
    " One to three years related experience and/or training; or equivalent combination of education",
    "and experience."
  ],
  "performance": [],
  "publicJSONPath": "/JSON-job-descriptions/finance___accounting/accounts_receivable_clerk___general_books.json",
  "publicPDFPath": "/uploaded-job-descriptions/accounts_receivable_clerk___general_books.pdf"
}