{
  "id": "5e3a3be6d8531aa80296cef0ca6482f25f2083aa1b76a1c7350b1d96c37abd55",
  "title": "Accounting Officer — Statistician",
  "department": "Finance & Accounting",
  "purpose": "The preparation of the monthly Refinery Statistics Report: detailing the volumetric movements\nof crude and petroleum products and across the refinery, and operating performance. This\ninvolves the classification and verification of Sales Data, Production Yields, Imports and\nInventory volumes for use in the preparation of monthly Refinery Statistics and Financial\nStatement.",
  "relationships": "Reports to Stocks & Sales Supervisor.",
  "supervisory": "This job has no supervisory responsibilities.",
  "knowledge": "To perform this job successfully, an individual must be able to perform each essential duty\nsatisfactorily. The requirements listed below are representative of the knowledge, skills, and/or\nabilities required.",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "1. Prepares Refinery Statistics Report detailing the volumetric movements of crude oil and",
    "petroleum products across the refinery's production, storage and distribution facilities;",
    "capturing sales volumes, imports and inventory volumes, fuel consumed, and deriving",
    "production yields and oil losses.",
    "2. Validate the Loading Racks' and refinery's reconciliations: all transactions from sales",
    "meters, loading tickets, shipping vessels to ensure that all customers are accurately",
    "invoiced.",
    "3. Prepare Import, Export, Production and Sales Reports to Government Agencies such as",
    "BOJ, PIOJ, STATIN, MSTEM etc. and address any queries arising from such.",
    "4. Distributes and archive Refinery Statistics and Production Reports.",
    "5. Perform second tier review for Sales & Distribution Invoices.",
    "6. Review invoices prior to dispatch to customers.",
    "7. Execute sales reporting requests from internal and external agencies",
    "8. Provide Sales & Distribution related support for financial audits such as sales",
    "confirmation, customer sales reconciliations and other special reports.",
    "9. Conduct monthly inventory count for warehouse inventory spares and petroleum products.",
    "10. Prepares other special reports: Loading Order Report, Bunker Import-Export Schedule.",
    "11. Any other duties that may be assigned by Supervisor.",
    "12. Generally complies with all rules and regulations or guidelines of various policies issued",
    "by any from time to time such as General Administration, Safety, Health and Loss",
    "Control."
  ],
  "education": [],
  "performance": [],
  "publicJSONPath": "/JSON-job-descriptions/finance___accounting/accounting_officer___statistician.json",
  "publicPDFPath": "/uploaded-job-descriptions/finance___accounting/accounting_officer___statistician.pdf"
}