{
  "id": "bc68e0292aa1ff992af4640d194f06602291585737c60e953ce636c0c216f0b8",
  "title": "Billing Officer I",
  "department": "Finance & Accounting",
  "purpose": "Create invoices and credit memo for all retail customers supplied across all the sales terminal of\nthe company i.e. Kingston Loading Rack (KLR), Montego Bay Loading Rack (MIR), Newport\nWest Loading Rack (NPWLR). In addition, be responsible for the safe delivery of invoices and\ncredit memos to customers by all necessary means; and performs other functions associated with\nthe billing process.",
  "relationships": "Reports to Stocks & Sales Accountant, Supervisor",
  "supervisory": "This job has no supervisory responsibilities.",
  "knowledge": "",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "1. Validates sales orders generated by the Dantas System for deliveries to retail customers",
    "supplied from MILR, KLR, NPWLR.",
    "2. Update the SAP S&D System with Sales Order information and produce customer invoices.",
    "3. Provide 1st tier review of invoices generated.",
    "4. Manages the distribution of invoices to customers.",
    "5. Compile daily gauge tickets and stock transfer forms for all product transferred from the",
    "Refinery and corresponding product receivals into loading terminals and marine vessels.",
    "6. Computes and reconciles volumetric movement between Refinery and Loading terminals.",
    "7. Prepares weekly El 7 Excise forms for custodial transfer of all petroleum products for the",
    "purpose of Special Consumption Tax (SCT) and Ad-Valorem tax assessment.",
    "8. Prepares journal entries for SCT and Adval Tax payable and post in SAP.",
    "9. Process credit memos for product returns, shortages and price adjustments.",
    "10. Compute commission to the Petroleum Corporation of Jamaica on a monthly basis.",
    "11. Submit export notices to brokers on a monthly basis.",
    "12. Conduct monthly stock count.",
    "13. Performs all other duties that may be assigned.",
    "14. Generally complies with all rules and regulations or guidelines of various policies issued by",
    "the company from time to time such as General Administration, Safety, Health and Loss",
    "Control."
  ],
  "education": [],
  "performance": [],
  "pdfPath": "/uploaded-job-descriptions/finance___accounting/accounts_officer___billing_officer.pdf"
}