{
  "id": "ea1c572e8b975628465d09d983e30675701aaaae50b3f5fc5822f9fa3eb6da6f",
  "title": "Cashier",
  "department": "Finance & Accounting",
  "purpose": "",
  "relationships": "Reports to Accounting Supervisor – General Books",
  "supervisory": "This job has no supervisory responsibilities.",
  "knowledge": "",
  "key_responsibilities": [
    "These include the following but other duties may be assigned from time to time.",
    "1. Responsible for all cash transactions.",
    "2. Maintains local and US petty cash imprests and is custodian for cashier combination vault.",
    "3. Batches and input to SAP paid petty cash vouchers for reimbursement.",
    "4. Reconciles suppliers’ accounts with statement of accounts received from them.",
    "5. Issues receipts for amounts received.",
    "6. Prepares reports of daily cash transactions (Daily Cash Report).",
    "7. Prepares receipt packs daily and delivers to A/C Receivable Officer.",
    "8. Prepares cash and cheque lodgments daily and present them to banking and investment for",
    "checking.",
    "9. Make arrangements with Brinks for the pick up and delivery of cash to Bank of Nova",
    "Scotia.",
    "10. Keeps a record of all lodgments given to Brinks to take to Bank of Nova Scotia.",
    "11. Prepare banking journals for all current and call accounts.",
    "12. Prepares cheques from Education Trust Fund and ensures that the account is properly",
    "maintained.",
    "13. Prepare reconciliations for all Bank Accounts.",
    "14. Custodian for and follows up on returned cheques.",
    "15. Assists at the Receivables desk, when necessary.",
    "16. Assist with monthly preparation of special report – Statement A, Statement C and PCJ",
    "report.",
    "17. Performs any other duties that may be assigned.",
    "18. Generally complies with all rules and regulations or guidelines of various polices issued by",
    "the Company from time to time such as General Administration, Safety, Health and Loss",
    "Prevention."
  ],
  "education": [],
  "performance": [],
  "pdfPath": "/uploaded-job-descriptions/finance___accounting/accounting_officer___cashier.pdf"
}